In [1]:
import pandas as pd
import numpy as np
data = {'Name' : ['Alice', 'Bob', 'Charlie', 'David'],
        'Age': [25, 30, None, 40],
        'Cabin': [None, 'B12', None, None]}
df = pd.DataFrame(data)
df

      Name   Age Cabin
0    Alice  25.0  None
1      Bob  30.0   B12
2  Charlie   NaN  None
3    David  40.0  None

In [2]:
#Handling missing values
threshold = 0.3 * len(df)
df.dropna(axis = 1, thresh=threshold, inplace=True)
df

      Name   Age
0    Alice  25.0
1      Bob  30.0
2  Charlie   NaN
3    David  40.0

In [3]:
#Imputing with median
from sklearn.impute import SimpleImputer
imputer = SimpleImputer(strategy='median')
df['Age'] = imputer.fit_transform(df[['Age']])
df

      Name   Age
0    Alice  25.0
1      Bob  30.0
2  Charlie  30.0
3    David  40.0

In [4]:
#Handling Outliers
df = pd.DataFrame({'Fare': [7.25, 8.05, 71.83, 512.32, 5.0]})
q1 = df['Fare'].quantile(0.25)
q3 = df['Fare'].quantile(0.75)
IQR = q3 - q1
lowerb = q1 - 1.5 * IQR
upperb = q3 + 1.5 * IQR
df['Outlier'] = (df['Fare'] < lowerb) | (df['Fare'] > upperb)
df

     Fare  Outlier
0    7.25    False
1    8.05    False
2   71.83    False
3  512.32     True
4    5.00    False

In [9]:
from scipy import stats

# Compute Z-score
df['Z_score'] = stats.zscore(df['Fare'])

# Mark outliers where |Z| > 3
df['Outlier'] = df['Z_score'].abs() > 1

print(df)

     Fare  Outlier   Z_score
0    7.25    False -0.575879
1    8.05    False -0.571825
2   71.83    False -0.248615
3  512.32     True  1.983600
4    5.00    False -0.587281

In [11]:
#Handling duplicates
df = pd.DataFrame({'Name': ['Alice', 'Bob', 'Alice'],
                   'Age': [25, 30, 25]})
print(df)
df = df.drop_duplicates()
df

    Name  Age
0  Alice   25
1    Bob   30
2  Alice   25

    Name  Age
0  Alice   25
1    Bob   30

In [12]:
df = pd.DataFrame({'City': ['New York', 'new york', 'NY', 'Los Angeles']})

# Standardizing Text Data
df['City'] = df['City'].str.lower().replace({'ny': 'new york'})
print(df)

          City
0     new york
1     new york
2     new york
3  los angeles

In [17]:
#Handling Date and Time
df = pd.DataFrame({'Date': ['2024-01-01', '2023-12-31', '2022-06-15']})
df['Date'] = pd.to_datetime(df['Date'])
df['Year'] = df['Date'].dt.year
df['Month'] = df['Date'].dt.month
df['Day'] = df['Date'].dt.day
df

        Date  Year  Month  Day
0 2024-01-01  2024      1    1
1 2023-12-31  2023     12   31
2 2022-06-15  2022      6   15

In [18]:
df = pd.DataFrame({'Name': [' Alice ', 'Bob  ', '  Charlie']})

# Remove leading and trailing spaces
df['Name'] = df['Name'].str.strip()
print(df)

      Name
0    Alice
1      Bob
2  Charlie

In [19]:
#Incorrect formats
df = pd.DataFrame({'Temperature': ['35C', '98F', '25C', '100F']})
df['Temperature'] = df['Temperature'].str.extract(r'(\d+)').astype(float)
df

   Temperature
0         35.0
1         98.0
2         25.0
3        100.0

In [24]:
df = pd.DataFrame({'Salary': [3000, -5000, 4000, -1000]})
df['Salary'] = df['Salary'].apply(lambda x: -x if x < 0 else x )
df

   Salary
0    3000
1    5000
2    4000
3    1000

In [25]:
df = pd.DataFrame({'Price': ['100', '200', 'Three Hundred', '400']})

# Convert non-numeric values to NaN
df['Price'] = pd.to_numeric(df['Price'], errors='coerce')
print(df)

   Price
0  100.0
1  200.0
2    NaN
3  400.0

#Other syntaxes
# Drop rows with any missing values
df.dropna(inplace=True)

# Drop columns with any missing values
df.dropna(axis=1, inplace=True)

# Drop rows where a specific column has missing values
df.dropna(subset=['Price'], inplace=True)
# Fill missing values with a constant
df.fillna(value=0, inplace=True)

# Fill missing values with column mean
df['ColumnName'].fillna(df['ColumnName'].mean(), inplace=True)

# Fill missing values using forward fill
df.fillna(method='ffill', inplace=True)

# Fill missing values using backward fill
df.fillna(method='bfill', inplace=True)

# Merge two dataframes on a common column
df_merged = pd.merge(df1, df2, on='CommonColumn', how='inner')

# Concatenating dataframes vertically
df_combined = pd.concat([df1, df2], axis=0)

# Filter rows based on a condition
filtered_df = df[df['ColumnName'] > 50]

# Select specific columns
selected_df = df[['Column1', 'Column2']]

# Multiply values in a column by 2
df['NewColumn'] = df['ColumnName'].apply(lambda x: x * 2)

# Convert column to uppercase
df['UpperName'] = df['Name'].apply(str.upper)

# Replace values based on a mapping dictionary
mapping = {'Male': 1, 'Female': 0}
df['GenderNumeric'] = df['Gender'].map(mapping)

# Convert all string values in DataFrame to lowercase
df = df.applymap(lambda x: x.lower() if isinstance(x, str) else x)

# Group by a column and calculate sum
df_grouped = df.groupby('Category')['Sales'].sum()
# Group by multiple columns and calculate mean and count
df_grouped = df.groupby(['Category', 'Subcategory']).agg({'Sales': ['sum', 'mean'], 'Profit': 'count'})

# Define a custom function
def range_func(x):
    return x.max() - x.min()

# Apply custom function in aggregation
df_grouped = df.groupby('Category')['Sales'].agg(range_func)
# Compute the mean within each group and keep the original shape
df['CategoryMean'] = df.groupby('Category')['Sales'].transform('mean')

# Find rows where column contains a specific word
df_filtered = df[df['Description'].str.contains('error', case=False, na=False)]

# Replace special characters with an empty string
df['CleanedText'] = df['TextColumn'].str.replace(r'[^A-Za-z0-9 ]+', '', regex=True)


# Select only numeric columns
numeric_df = df.select_dtypes(include=['number'])

# Select only string columns
string_df = df.select_dtypes(include=['object'])

# Select columns containing a specific word
df_filtered = df.filter(like='Price', axis=1)

# Select columns that start with 'Sales'
df_filtered = df.filter(regex='^Sales', axis=1)
# Keep only columns where at least one value is greater than 100
df_filtered = df.loc[:, (df > 100).any()]